# FbxLightSpotBeamAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightSpotBeamAngle Property
ParameterTypeId Class See Also
---
"Spot Beam Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightSpotBeamAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightSpotBeamAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightSpotBeamAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace